ProgessBase/Catalogs/АдресаПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>АдресаПоставки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дивизион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДивизионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопОфис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДопОфисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_КатегорияКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_КатегорииКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_ТорговыеПредставители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_КаналПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_КаналыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_Маршрут</Name>
					<Comment>Маршрут по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПТЛ_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Территории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_GLN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_ЖДСтанция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_ЖДСтанции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_КлассТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_КлассификаторТорговыхТочек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_НаправлениеПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_НаправленияПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНСИ_ФорматТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_ФорматыТорговыхТочек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_УсловияПоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПТЛ_УсловияПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПКК_ДопустимоеЧислоДнейЗадолженности</Name>
					<Comment>Отсрочка платежа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_ДатаЗакрытия</Name>
					<Comment>Дата закрытия торговой точки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_Грузоподъемность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_КомментарийДиспетчеру</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_ОбедС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_ОбедПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_ТЭК</Name>
					<Comment>Если условие доставки до ТЭК, то указываем ТЭК по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПТЛ_КодКлиента</Name>
					<Comment>Код клиента по данным ТЭК (для РЦ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_ОсновноеКонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>Добавили для обмена с Контуром</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Добавили для обмена с Контуром</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_Округ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Округа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НСИ_НомерМагазина</Name>
					<Comment>Для печати документов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГМаршрутыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МРЧ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГМаршрутыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГМаршрутыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГМаршрутыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГМаршрутыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГМаршрутыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НМКК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГМаршрутыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МРГУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГМаршрутыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КП_АдресДоставкиТЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Comment>Используется если грузополучатель не совпадает с контрагентом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КППСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПропуска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УСЗ_ОбобщенныйКлиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСЗ_ОбобщенныеКлиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаДляЗаказаПропусков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/InformationRegisters/ПКК_ИсторияИзмененияКредитногоЛимитаИОтсрочкиПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПКК_ИсторияИзмененияКредитногоЛимитаИОтсрочкиПлатежа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопустимоеЧислоДнейЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПКК_КредитныйЛимитЗависитОтПланаПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьСуммуЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Catalogs/АдресаПоставки/Ext/ObjectModule.bsl
//m.ionov@a-prof.ru 22.10.2014
Процедура ПередЗаписью(Отказ)
	
	//{01.06.2015 Островерхий заявка №б/н 
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;  
	//01.06.2015 Островерхий} 
	
	Если Не Владелец = Неопределено Тогда
		ЮрФизЛицо = Владелец.ЮрФизЛицо;
	КонецЕсли;
	
	//{09.02.2015 Островерхий заявка №б/н 
	Если КодАдреса = "" Тогда
		КодАдреса = СформироватьНовыйКодАдреса();	
	КонецЕсли;  
	//09.02.2015 Островерхий} 
	
	//{05.05.2017 Островерхий заявка №63784 
	Если УСЗ_ОбобщенныйКлиент.Пустая()
		И ТипЗнч(Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		УСЗ_ОбобщенныйКлиент = Владелец.УСЗ_ОбобщенныйКлиент;	
	КонецЕсли;  
	//05.05.2017 Островерхий}
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//начало изменений Ожиганов 14.07.2015 создание базы МСФО
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;  
	//конец изменений 
	Если Не Отказ Тогда
		ЗаписатьИзменениеОтсрочки(Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьИзменениеОтсрочки(Отказ)
	
	Если Не ПравоДоступа("Изменение",Метаданные.РегистрыСведений.ПКК_ИсторияИзмененияКредитногоЛимитаИОтсрочкиПлатежа) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПоРегистру = РегистрыСведений.ПКК_ИсторияИзмененияКредитногоЛимитаИОтсрочкиПлатежа.СрезПоследних(ТекущаяДата(), Новый Структура("Объект", Ссылка));
	
	Если ДанныеПоРегистру.Количество() = 0 Тогда
		СформируемЗаписьПоРегиструОтсрочка(Отказ);
	ИначеЕсли НЕ ДанныеПоРегистру[0].ДопустимоеЧислоДнейЗадолженности = ПКК_ДопустимоеЧислоДнейЗадолженности Тогда
	    СформируемЗаписьПоРегиструОтсрочка(Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура СформируемЗаписьПоРегиструОтсрочка(Отказ)
			
	мДатаЗаписи = ТекущаяДата();
	
	НаборЗаписей = РегистрыСведений.ПКК_ИсторияИзмененияКредитногоЛимитаИОтсрочкиПлатежа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Отбор.Период.Установить(мДатаЗаписи);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяСтрока = НаборЗаписей.Добавить();
	Иначе
		НоваяСтрока = НаборЗаписей.Получить(0);
	КонецЕсли;
	НоваяСтрока.Период = мДатаЗаписи;
	НоваяСтрока.Объект = Ссылка;
	НоваяСтрока.ДопустимоеЧислоДнейЗадолженности = ПКК_ДопустимоеЧислоДнейЗадолженности;
	НоваяСтрока.Пользователь = глЗначениеПеременной("глТекущийПользователь");
	
	Попытка		
		НаборЗаписей.Записать();		
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ);
	КонецПопытки;

КонецПроцедуры
//----m.ionov@a-prof.ru---

//{09.02.2015 Островерхий заявка №б/н 
Функция СформироватьНовыйКодАдреса() Экспорт 

    тКодАдреса = "АП1";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПОДСТРОКА(АдресаПоставки.КодАдреса, 3, 10) КАК Строка,
		|	АдресаПоставки.Ссылка КАК НомерСтроки
		|ПОМЕСТИТЬ Дано
		|ИЗ
		|	Справочник.АдресаПоставки КАК АдресаПоставки
		|ГДЕ
		|	АдресаПоставки.Владелец = &Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	0 КАК С,
		|	1 КАК П
		|ПОМЕСТИТЬ Р16
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	1,
		|	10
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	2,
		|	100
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	3,
		|	1000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	4,
		|	10000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	5,
		|	100000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	6,
		|	1000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	7,
		|	10000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	8,
		|	100000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	9,
		|	1000000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	10,
		|	10000000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	11,
		|	100000000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	12,
		|	1000000000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	13,
		|	10000000000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	14,
		|	100000000000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	15,
		|	1000000000000000
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	16,
		|	10000000000000000
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(А.П * Б.С * ВЫБОР
		|			КОГДА ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
		|				ТОГДА 10
		|			ИНАЧЕ 1
		|		КОНЕЦ) / МИНИМУМ(ВЫБОР
		|			КОГДА НЕ ПОДСТРОКА(Дано.Строка, 1, 17 - А.С) ПОДОБНО ""%.%""
		|				ТОГДА А.П
		|			ИНАЧЕ 100000000000000000
		|		КОНЕЦ) КАК Ответ
		|ПОМЕСТИТЬ втКодАПЧислом
		|ИЗ
		|	Дано КАК Дано,
		|	Р16 КАК А,
		|	Р16 КАК Б
		|ГДЕ
		|	Б.С < 10
		|	И ПОДСТРОКА(Дано.Строка, 17 - А.С, 1) = ПОДСТРОКА(""0123456789"", Б.С + 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	Дано.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(втКодАПЧислом.Ответ, 0)) КАК КодАдреса
		|ИЗ
		|	втКодАПЧислом КАК втКодАПЧислом";

	Запрос.УстановитьПараметр("Владелец",Владелец);	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Попытка
			
			//ЭтоРЦ = Найти(ВыборкаДетальныеЗаписи.КодАдреса,"РЦ") > 0;
			//тКодАдреса = Число(СтрЗаменить(СтрЗаменить(ВыборкаДетальныеЗаписи.КодАдреса,"АП",""),"РЦ",""))+1;	
			//тКодАдреса = ?(ЭтоРЦ,"РЦ","АП")+СтрЗаменить(Строка(тКодАдреса),Символы.НПП,"");
			ЗапросКодАдреса = ?(ВыборкаДетальныеЗаписи.КодАдреса = Null,0,ВыборкаДетальныеЗаписи.КодАдреса);
			тКодАдреса = "АП"+СтрЗаменить(Строка(ЗапросКодАдреса+1),Символы.НПП,"");
			
		Исключение
			
			Сообщить("При формировании нового кода АП произошла ошибка!",СтатусСообщения.ОченьВажное);
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки; 
	
	КонецЕсли; 
	
	Возврат тКодАдреса;

КонецФункции // СформироватьНовыйКодАдреса()

Процедура ПриКопировании(ОбъектКопирования)
	
	КодАдреса = "";
	
КонецПроцедуры
//09.02.2015 Островерхий} 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//>>170715 Степанов закомментировано: не у всех есть доступ к этим реквизитам
	////{01.06.2015 Островерхий заявка №40234 
	//Если ТипЗнч(Владелец) = тип("СправочникСсылка.Контрагенты") Тогда
	//
	//	ПроверяемыеРеквизиты.Добавить("Дивизион");	
	//	ПроверяемыеРеквизиты.Добавить("НСИ_КатегорияКлиента");
	//	ПроверяемыеРеквизиты.Добавить("ДопОфис");	
	//
	//КонецЕсли;  
	////01.06.2015 Островерхий} 
	
КонецПроцедуры
